[
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/nuwaubian-nation-moors",
    "location": "Georgia",
    "description": "Originally a putatively Muslim group, Nuwaubianism is best understood as a cult that promotes a bizarre and complicated “theology.”",
    "name": "Nuwaubian Nation of Moors",
    "ideology": "Black Separatist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/family-research-council",
    "location": "Washington, D.C.",
    "description": "The Family Research Council (FRC) bills itself as “the leading voice for the family in our nation’s halls of power,” but its real specialty is defaming gays and lesbians.",
    "name": "Family Research Council",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/american-renaissance",
    "location": "Oakton, Va.",
    "description": "Founded by Jared Taylor in 1990, the New Century Foundation is a self-styled think tank that promotes pseudo-scientific studies and research that purport to show the inferiority of blacks to whites. It is best known for its American Renaissance magazine and website.",
    "name": "American Renaissance",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/consejo-de-investigaci%C3%B3n-familiar",
    "location": "Washington, D.C.",
    "description": "FRC, Consejo de Investigación Familiar se autodenomina “el portavoz para la familia en los círculos del poder de nuestra nación”, pero su verdadera especialidad es difamar a los hombres y mujeres homosexuales.",
    "name": "Consejo de Investigación Familiar",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/euro",
    "location": "Mandeville, LA",
    "description": "Founded in 2000 under a different name by the former Klan leader and notorious neo-Nazi David Duke, the European-American Unity and Rights Organization (EURO) claims to fight for \"White Civil Rights\" for \"European and Americans Wherever They May Live.\"",
    "name": "EURO",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/national-alliance",
    "location": "Mill Point, WV",
    "description": "The National Alliance (NA) was for decades the most dangerous and best organized neo-Nazi formation in America. Explicitly genocidal in its ideology, NA materials call for the eradication of the Jews and other races and the creation of an all-white homeland.",
    "name": "National Alliance",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/aryan-nations",
    "location": "Chillicothe, Ohio",
    "description": "Aryan Nations (AN) was once a powerful organizing force for white supremacists that cultivated a wide spectrum of racist and anti-Semitic ideas.",
    "name": "Aryan Nations",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/traditional-values-coalition",
    "location": "Anaheim, Calif., Washington, D.C.",
    "description": "Presbyterian minister Lou Sheldon founded the Traditional Values Coalition (TVC) in 1980 to spread a “moral code and behavior based upon the Old and New Testaments” and to warn Americans of the rising “gay threat.” The traditional values the TVC fights for include: the right to life (opposition to abortion and euthanasia), chastity and patriotism, along with opposition to homosexuality, pornography, the teaching of evolution in public schools and illegal immigration.",
    "name": "Traditional Values Coalition",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/barnes-review",
    "location": "Washington, D.C.",
    "description": "Founded by Willis Carto in 1994, The Barnes Review (TBR) is one of the most virulent anti-Semitic organizations around. Its flagship journal, The Barnes Review, and its website, Barnesreview.org, are dedicated to historical revisionism and Holocaust denial.",
    "name": "Barnes Review",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/creativity-movement",
    "location": "Zion, Ill.",
    "description": "The Creativity Movement is the latest of several incarnations of the racist group (and religion) originally known as Church of the Creator. The movement promotes what it sees as the inherent superiority and “creativity” of the white race.",
    "name": "The Creativity Movement",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/vdare",
    "location": "Washington, Conn.",
    "description": "Originally established in 1999 by the Center for American Unity, a Virginia-based nonprofit foundation started by English immigrant Peter Brimelow, VDARE.com is an anti-immigration hate website \"dedicated to preserving our historical unity as Americans into the 21st Century.\"",
    "name": "VDARE",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/aryan-brotherhood-texas",
    "location": "",
    "description": "Founded in the early 1980s, the Aryan Brotherhood of Texas, also known as the ABT, the Tip and Ace Deuce, is an unrelated knockoff of the racist prison gang Aryan Brotherhood. It is one of the deadliest prison gangs in the Texas Department of Prisons, and also a statewide crime syndicate. Like the Aryan Brotherhood, the ABT has a strictly hierarchical leadership structure and has members both inside the state’s prisons and on the streets.",
    "name": "Aryan Brotherhood of Texas",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/nation-islam",
    "location": "Chicago, IL",
    "description": "Since its founding in 1930, the Nation of Islam (NOI) has grown into one of the wealthiest and best-known organizations in black America. Its theology of innate black superiority over whites and the deeply racist, anti-Semitic and anti-gay rhetoric of its leaders have earned the NOI a prominent position in the ranks of organized hate.",
    "name": "Nation of Islam",
    "ideology": "Black Separatist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/keystone-united",
    "location": "Harrisburg, PA",
    "description": "Keystone United, known until 2009 as the Keystone State Skinheads (KSS), is one of the largest and most active single-state racist skinhead crews in the country.",
    "name": "Keystone United",
    "ideology": "Racist Skinhead"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/worldnetdaily",
    "location": "Centreville, Va.",
    "description": "WorldNetDaily is an online publication founded and run by Joseph Farah that claims to pursue truth, justice and liberty. But in fact, its pages are devoted to manipulative fear-mongering and outright fabrications designed to further the paranoid, gay-hating, conspiratorial and apocalyptic visions of Farah and his hand-picked contributors from the fringes of the far-right and fundamentalist worlds.",
    "name": "WorldNetDaily",
    "ideology": "Antigovernment Movement"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/american-border-patrolamerican-patrol",
    "location": "Sierra Vista, AZ",
    "description": "American Border Patrol/American Patrol (the first-listed group was essentially an Arizona extension of American Patrol, which is also known as Voice of Citizens Together) is one of the most virulent anti-immigrant groups around.",
    "name": "American Border Patrol/American Patrol",
    "ideology": "Anti-Immigrant"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/conselho-de-pesquisa-familiar",
    "location": "Washington, D.C.",
    "description": "O Family Research Council (Conselho de Pesquisa Familiar – FRC) se apresenta como “a principal voz pela família nos salões do poder de nossa nação”, mas sua verdadeira especialidade é difamar gays e lésbicas.",
    "name": "Conselho de Pesquisa Familiar",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/%D1%81%D0%BE%D0%B2%D0%B5%D1%82-%D0%B8%D1%81%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B9-%D0%BF%D0%BE-%D0%B2%D0%BE%D0%BF%D1%80%D0%BE%D1%81%D0%B0%D0%BC-%D1%81%D0%B5%D0%BC%D1%8C%D0%B8",
    "location": "Вашингтон, округ Колумбия.",
    "description": "Совет исследований семьи (FRC) считает себя «ведущим голосом семей в кулуарах власти нашей нации», но его реальная особенность - клевета на геев и лесбиянок. FRC часто делает ложные заявления об обществе ЛГБТ, основанные на дискредитированных исследованиях и лженауке. Намерением является очернить ЛГБТ в их боях против [запретов] браков между лицами одинакового пола, законов о преступлениях на почве ненависти, программы борьбы с издевательствами и отмены политики военных «Не спрашивают, не говори».",
    "name": "Совет исследований по вопросам семьи ",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/act-america",
    "location": "Virginia Beach, Virginia",
    "description": "Brigitte Tudor, better known as Brigitte Gabriel, founded ACT! for America in 2007 at a time when the anti-Muslim movement America was beginning to take shape in the United States. In the years since, the group has grown to become the largest grassroots anti-Muslim group in America, claiming 280,000 members and over 1,000 chapters.",
    "name": "ACT! for America ",
    "ideology": "Anti-Muslim"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/occidental-quarterly",
    "location": "Atlanta, GA",
    "description": "Founded in 2001 by Chicago millionaire publishing scion William H. Regnery, the Charles Martel Society publishes The Occidental Quarterly (TOQ), a racist journal devoted to the idea that as whites become a minority \"the civilization and free governments that whites have created\" will be jeopardized.",
    "name": "Occidental Quarterly",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/federation-american-immigration-reform",
    "location": "Washington, D.C.",
    "description": "The Federation for American Immigration Reform (FAIR) is a group with one mission: to severely limit immigration into the United States. Although FAIR maintains a veneer of legitimacy that has allowed its principals to testify in Congress and lobby the federal government, this veneer hides much ugliness.",
    "name": "Federation for American Immigration Reform",
    "ideology": "Anti-Immigrant"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/jewish-defense-league",
    "location": "New York, NY",
    "description": "The Jewish Defense League (JDL) is a radical organization that preaches a violent form of anti-Arab, Jewish nationalism. Its late founder, Rabbi Meir Kahane, claimed that Jews face fierce anti-Semitism domestically and abroad and must protect themselves by any means necessary.",
    "name": "Jewish Defense League",
    "ideology": ""
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/traditionalist-workers-party",
    "location": "Cincinnati, Ohio",
    "description": "The Traditionalist Workers Party is a white nationalist group that advocates for racially pure nations and communities and blames Jews for many of the world’s problems. Even as it claims to oppose racism, saying every race deserves its own lands and culture, the group is intimately allied with neo-Nazi and other hardline racist organizations that espouse unvarnished white supremacist views.",
    "name": "Traditionalist Workers Party",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/american-family-association",
    "location": "Tupelo, Miss.",
    "description": "The American Family Association (AFA) says it promotes \"traditional moral values\" in media. A large part of that work involves \"combating the homosexual agenda\" through various means, including publicizing companies that have pro-gay policies and organizing boycotts against them.",
    "name": "American Family Association",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/fundamentalist-church-jesus-christ-latter-day-saints",
    "location": "Eldorado, TX",
    "description": "Still actively practicing polygamy more than a century after the mainstream Mormon Church abandoned the practice, the Fundamentalist Church of Jesus Christ of Latter-day Saints (FLDS) is a white supremacist, homophobic, antigovernment, totalitarian cult.",
    "name": "Fundamentalist Church of Jesus Christ of Latter-Day Saints",
    "ideology": ""
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/pioneer-fund",
    "location": "New York, NY",
    "description": "Started in 1937 by textile magnate Wickliffe Draper, the Pioneer Fund's original mandate was to pursue \"race betterment\" by promoting the genetic stock of those \"deemed to be descended predominantly from white persons who settled in the original thirteen states prior to the adoption of the Constitution.\"",
    "name": "Pioneer Fund",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/national-vanguard",
    "location": "Charlottesville, Va.",
    "description": "Formed in 2005 by longtime activist Kevin Strom, National Vanguard was a breakaway group from the neo-Nazi National Alliance. National Vanguard was increasing its membership before the arrest and imprisonment of its leader, Kevin Strom, in 2007 for child pornography and witness tampering, after which the group fell apart.",
    "name": "National Vanguard",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/national-socialist-movement",
    "location": "Detroit, Mich.",
    "description": "An organization that specializes in theatrical and provocative protests, the National Socialist Movement (NSM) is one of the largest and most prominent neo-Nazi groups in the United States.",
    "name": "National Socialist Movement",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/blood-honour",
    "location": "",
    "description": "Based in the United Kingdom, Blood & Honour is a shadowy international coalition of racist skinhead gangs. In the United States, two rival groups claim to be affiliated with Blood & Honour.",
    "name": "Blood & Honour",
    "ideology": "Racist Skinhead"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/white-revolution",
    "location": "Russellville, AR",
    "description": "White Revolution is a neo-Nazi group that employs the most violent language and works with some of the most virulent leaders in the world of white supremacy, while claiming to remain legal. It has sought to unite groups across the radical spectrum, but has been singularly unsuccessful.",
    "name": "White Revolution",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/church-national-knights-ku-klux-klan",
    "location": "South Bend, IN",
    "description": "Once one of the largest and most active Klan groups in America, the Church of the National Knights of the Ku Klux Klan has more recently gained a kind of \"Keystone Kops\" reputation on the white supremacist scene for its bumbling ways.",
    "name": "Church of the National Knights of the Ku Klux Klan",
    "ideology": "Ku Klux Klan"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/white-lives-matter",
    "location": "",
    "description": "White Lives Matter, a racist response to the civil rights movement Black Lives Matter, is a neo-Nazi group that is growing into a movement as more and more white supremacist groups take up its slogans and tactics.",
    "name": "White Lives Matter",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/institute-historical-review",
    "location": "Newport Beach, CA",
    "description": "Founded in 1978 by Willis Carto, a longtime anti-Semite, the Institute for Historical Review (IHR) is a pseudo-academic organization that claims to seek \"truth and accuracy in history,\" but whose real purpose is to promote Holocaust denial and defend Nazism.",
    "name": "Institute for Historical Review",
    "ideology": "Holocaust Denial"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/aryan-brotherhood",
    "location": "",
    "description": "The Aryan Brotherhood, also known as The Brand, Alice Baker, AB or One-Two, is the nation’s oldest major white supremacist prison gang and a national crime syndicate. Founded in 1964 by Irish bikers as a form of protection for white inmates in newly desegregated prisons, the AB is today the largest and deadliest prison gang in the United States, with an estimated 20,000 members inside prisons and on the streets.",
    "name": "Aryan Brotherhood",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/conseil-de-recherche-sur-la-famille",
    "location": "Washington, D.C.",
    "description": "Le Family Research Council (Conseil south recherche la famille, FRC) is décrit comme étant \"le porte-parole principal of the Deposited famille des puissants of the nation\", mais sa vraie spécialité est diffamer them homosexuels et les lesbiennes.",
    "name": "Conseil de recherche sur la famille",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/american-freedom-party",
    "location": "Las Vegas, Nevada",
    "description": "The American Freedom Party (formerly American Third Position) is a political party initially established by racist Southern California skinheads that aims to deport immigrants and return the United States to white rule.",
    "name": "American Freedom Party",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/league-south",
    "location": "Killen, Ala.",
    "description": "The League of the South is a neo-Confederate group that advocates for a second Southern secession and a society dominated by “European Americans.” The league believes the “godly” nation it wants to form should be run by an “Anglo-Celtic” (read: white) elite.",
    "name": "League of the South",
    "ideology": "Neo-Confederate"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/center-security-policy",
    "location": "Washington DC",
    "description": "Founded in 1988 by former Reagan administration official Frank Gaffney, Jr., The Center for Security Policy (CSP) has gone from a respected hawkish think tank focused on foreign affairs to a conspiracy-oriented mouthpiece for the growing anti-Muslim movement in the United States.",
    "name": "Center for Security Policy",
    "ideology": "Anti-Muslim"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/new-black-panther-party",
    "location": "Washington, D.C.",
    "description": "The New Black Panther Party is a virulently racist and anti-Semitic organization whose leaders have encouraged violence against whites, Jews and law enforcement officers.",
    "name": "New Black Panther Party",
    "ideology": "Black Separatist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/creativity-movement-0",
    "location": "East Peoria, IL",
    "description": "A self-styled religious organization, the Creativity Movement incessantly promotes what it sees as the inherent superiority and \"creativity\" of the white race — about the only tenets there are to its supposed \"theology.\" The group was formed in 1973 as the Church of the Creator and was later renamed the World Church of the Creator (WCOTC).",
    "name": "Creativity Movement",
    "ideology": "Neo-Nazi"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/national-coalition-immigration-reform",
    "location": "Huntington Beach, Calif.",
    "description": "The National Council for Immigration Reform is the latest incarnation of a group originally called the California Coalition for Immigration Reform, renamed after the 2013 death of founder Barbara Coe. Coe was known for referring to immigrants as “savages,” alleging a secret Mexican plan to “reconquer” the American Southwest, and claiming that immigration had led to an epidemic of rape and murder.",
    "name": "National Coalition for Immigration Reform",
    "ideology": "Anti-Immigrant"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/liberty-counsel",
    "location": "Orlando, Fl.",
    "description": "Liberty Counsel is a legal organization advocating for anti-LGBT discrimination under the guise of religious liberty.",
    "name": "Liberty Counsel",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/council-conservative-citizens",
    "location": "St. Louis, MO",
    "description": "The Council of Conservative Citizens (CCC) is the modern reincarnation of the old White Citizens Councils, which were formed in the 1950s and 1960s to battle school desegregation in the South. Created in 1985 from the mailing lists of its predecessor organization, the CCC has evolved into a crudely white supremacist group.",
    "name": "Council of Conservative Citizens",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/imperial-klans-america",
    "location": "Dawson Springs, KY",
    "description": "Until the late 2000s the second largest Klan group in the nation, the Imperial Klans of America (IKA) today is smaller but remains active despite a $2.5 million judgment against its leader and several followers in a lawsuit brought by the Southern Poverty Law Center in 2008.",
    "name": "Imperial Klans of America",
    "ideology": "Ku Klux Klan"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/westboro-baptist-church",
    "location": "Topeka, Kan.",
    "description": "Westboro Baptist Church (WBC) is arguably the most obnoxious and rabid hate group in America.",
    "name": "Westboro Baptist Church",
    "ideology": "Anti-LGBT"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/stormfront",
    "location": "West Palm Beach, FL",
    "description": "Created by former Alabama Klan boss and long-time white supremacist Don Black in 1995, Stormfront was the first major hate site on the Internet. Claiming more than 300,000 registered members as of May 2015 (though far fewer remain active), the site has been a very popular online forum for white nationalists and other racial extremists.",
    "name": "Stormfront",
    "ideology": "White Nationalist"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/vinlanders-social-club",
    "location": "Indianapolis, Ind.",
    "description": "The Vinlanders Social Club was formed in 2003 by a handful of former members and associates of a rogue racist skinhead group, the Outlaw Hammerskins. Publicly the Vinlanders appeared to be a coalition of independent state skinhead crews, but in reality the group functioned as a single entity.",
    "name": "Vinlanders Social Club",
    "ideology": "Racist Skinhead"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/americas-promise-ministries",
    "location": "Sandpoint, Idaho",
    "description": "America's Promise Ministry is both a Christian Identity church and a major publisher and distributor of right-wing extremist tracts.",
    "name": "America's Promise Ministries",
    "ideology": "Christian Identity"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/social-contract-press",
    "location": "Petoskey, Mich.",
    "description": "The Social Contract Press (TSCP) routinely publishes race-baiting articles penned by white nationalists. The press is a program of U.S. Inc, the foundation created by John Tanton, the racist founder and principal ideologue of the modern nativist movement. TSCP puts an academic veneer of legitimacy over what are essentially racist arguments about the inferiority of today's immigrants.",
    "name": "The Social Contract Press",
    "ideology": "Anti-Immigrant"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/brotherhood-klans",
    "location": "Marion, OH",
    "description": "The Brotherhood of Klans (BOK) has long been one of the largest and most widespread Ku Klux Klan organizations in the United States. It’s also the only KKK faction to establish chapters outside the U.S., with a sizable presence in Canada.",
    "name": "Brotherhood of Klans",
    "ideology": "Ku Klux Klan"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/knights-ku-klux-klan",
    "location": "Harrison, AR",
    "description": "Founded by David Duke in 1975, the Knights of the Ku Klux Klan has attempted to put a \"kinder, gentler\" face on the Klan, courting media attention and attempting to portray itself as a modern \"white civil rights\" organization. But beneath that veneer lurks the same bigoted rhetoric.",
    "name": "Knights of the Ku Klux Klan",
    "ideology": "Ku Klux Klan"
  },
  {
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/group/kingdom-identity-ministries",
    "location": "Harrison, AR",
    "description": "Kingdom Identity Ministries is the largest supplier in existence of materials related to Christian Identity, a radical-right theology that generally identifies people of color as soulless sub-humans and Jews as satanic or cursed by God.",
    "name": "Kingdom Identity Ministries ",
    "ideology": "Christian Identity"
  }
]