[
  {
    "description": "A veteran of the anti-gay movement, Lively has been actively propagandizing against LGBT people since the early 1990s, but he's perhaps best-known for co-writing the thoroughly discredited, Holocaust revisionist book The Pink Swastika: Homosexuality in the Nazi Party (1995), which claims that the Nazi party was full of gay men who, because of their \"savagery,\" were able to carry out the Holocaust.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/scott-lively",
    "born": "1957",
    "name": "Scott Lively"
  },
  {
    "description": "Retired three-star general Jerry Boykin was the Undersecretary of Defense for Intelligence (2002-2007) during the President George W. Bush administration. Boykin’s decorated 36-year military career included 13 years as a commando in Delta Force, the United States Army’s elite special operations, counter-terrorism unit.",
    "ideology": "Anti-Muslim",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/lieutenant-general-william-g-%E2%80%9Cjerry%E2%80%9D-boykin-ret",
    "born": "1949",
    "name": "Lieutenant General William G. “Jerry” Boykin (Ret.)"
  },
  {
    "description": "Larry Pratt is a gun rights extremist who also advocates a theocratic society based on Old Testament civil and religious laws, and a pivotal figure in the militia movement.",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/larry-pratt",
    "born": "1942",
    "name": "Larry Pratt"
  },
  {
    "description": "Jean-Philippe Rushton is a psychology professor, author of a handful of academic tomes and numerous articles, and a onetime fellow of the John Simon Guggenheim Memorial Foundation — and probably the most important race scientist at work today.",
    "ideology": "White Nationalist",
    "died": "2012",
    "group": "Pioneer Fund",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/jean-philippe-rushton",
    "born": "1943",
    "name": "Jean-Philippe  Rushton"
  },
  {
    "description": "A battle-hardened veteran of the hate movement, Ron Edwards is the imperial wizard, or national leader, of the Imperial Klans of America (IKA), one of the nation's largest Klan groups.",
    "ideology": "Ku Klux Klan",
    "died": "",
    "group": "Imperial Klans of America",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/ron-edwards",
    "born": "1959",
    "name": "Ron Edwards"
  },
  {
    "description": "Masquerading as a media watchdog, Cliff Kincaid is actually an unrepentant propagandist for extremist right-wing causes who knows few boundaries in his attempts to smear liberal foes.",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/cliff-kincaid",
    "born": "1954",
    "name": "Cliff Kincaid"
  },
  {
    "description": "Paul Cameron is an infamous anti-gay propagandist whose one-man statistical chop shop, the Family Research Institute, churns out hate literature masquerading as legitimate science.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/paul-cameron",
    "born": "1939",
    "name": "Paul  Cameron"
  },
  {
    "description": "William Daniel Johnson, a Los Angeles corporate lawyer, is an uninspiring but determined white separatist.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "American Freedom Party",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/william-daniel-johnson",
    "born": "1954",
    "name": "William Daniel Johnson"
  },
  {
    "description": "An intellectual and key white nationalist writer, the late Sam Francis has been referred to by analyst Leonard Zeskind as the \"philosopher king\" of the radical right.",
    "ideology": "White Nationalist",
    "died": "2005",
    "group": "Occidental Quarterly",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/sam-francis",
    "born": "1947",
    "name": "Sam Francis"
  },
  {
    "description": "Gordon Baum was the co-founder and CEO of the Council of Conservative Citizens (CCC), a virulently racist group whose website has referred to blacks as \"a retrograde species of humanity\" and which once characterized non-white immigration as turning the U.S. population into a \"slimy brown mass of glop.\"",
    "ideology": "White Nationalist",
    "died": "2015",
    "group": "Council of Conservative Citizens",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/gordon-baum",
    "born": "1940",
    "name": "Gordon  Baum"
  },
  {
    "description": "Alex Linder, a foul-mouthed but nattily dressed neo-Nazi, is the operator of the gutturally racist website Vanguard News Network (VNN).",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/alex-linder",
    "born": "1966",
    "name": "Alex Linder"
  },
  {
    "description": "James Edwards hosts “The Political Cesspool,” a racist, anti-Semitic radio show he founded in 2005 and based just outside Memphis, Tenn.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/james-edwards",
    "born": "1980",
    "name": "James Edwards"
  },
  {
    "description": "For almost a decade, neo-Nazi Morris Gullet has strived for one thing — to be officially recognized as the official, bona fide successor to the late Aryan Nations founder Richard G. Butler.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/morris-gulett",
    "born": "1956",
    "name": "Morris Gulett"
  },
  {
    "description": "David Yerushalmi is a New York lawyer and anti-Muslim activist who is a leading proponent of the idea that the United States is threatened by the imposition of Muslim religious law, known as Shariah.",
    "ideology": "Anti-Muslim",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-yerushalmi",
    "born": "1957",
    "name": "David Yerushalmi"
  },
  {
    "description": "Michael Levin, professor of philosophy at City University of New York (CUNY), is an unabashed white supremacist who argues that black people are innately less intelligent, less moral, and more criminal than their white peers.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/michael-levin",
    "born": "1943",
    "name": "Michael Levin"
  },
  {
    "description": "William Pierce, America's most important neo-Nazi for some three decades until his death in 2002, was the founder and leader of the National Alliance, a group whose members included terrorists, bank robbers and would-be bombers.",
    "ideology": "Neo-Nazi",
    "died": "2002",
    "group": "National Alliance",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/william-pierce",
    "born": "1933",
    "name": "William  Pierce"
  },
  {
    "description": "Barry Black is emblematic of the gutter aspects of the Ku Klux Klan thanks to his lengthy criminal history. He became a minor white supremacist celebrity after he was arrested in 1998 for burning a cross on private land with the permission of the landowner.",
    "ideology": "Ku Klux Klan",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/barry-black",
    "born": "1948",
    "name": "Barry Black"
  },
  {
    "description": "Roger Pearson is a retired British anthropologist and purveyor of extreme racist and anti-Semitic ideas. Over the course of his career, Pearson has been a fierce defender of “Aryan” racial superiority, and has maintained ties to numerous Nazi and neo-Nazi groups and individuals, promoting and publishing their theories in pseudo-academic journals like Mankind Quarterly, which Pearson has run since 1978.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/roger-pearson",
    "born": "1927",
    "name": "Roger Pearson"
  },
  {
    "description": "Arthur Jensen was arguably the father of modern academic racism. For over 40 years, Jensen, an educational psychologist at the University of California, Berkeley, provided a patina of academic respectability to pseudoscientific theories of black inferiority and segregationist public policies. Jensen was responsible for resurrecting the idea that the black population is inherently and immutably less intelligent than the white population, an ideology that immediately became known as “jensenism.”",
    "ideology": "White Nationalist",
    "died": "2012",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/arthur-jensen",
    "born": "1923",
    "name": "Arthur Jensen"
  },
  {
    "description": "After decades of trying to insert his distinctive brand of Christian fundamentalism into mainstream politics, Chuck Baldwin appears to have given up trying to infiltrate Capitol Hill and moved instead into the wilds.",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/chuck-baldwin",
    "born": "1953",
    "name": "Chuck Baldwin"
  },
  {
    "description": "A former Klan state leader and long-time white supremacist, Don Black is best known for creating Stormfront.org, the first major Internet hate site.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "Stormfront",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/don-black",
    "born": "1953",
    "name": "Don  Black"
  },
  {
    "description": "Richard Lynn is one of the most unapologetic and raw “scientific” racists operating today, arguing, among other things, that nations with high average IQs must subjugate or eliminate lower-IQ groups, which he associates with particular racial groups, in order to preserve their dominance.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "Pioneer Fund",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/richard-lynn",
    "born": "1930",
    "name": "Richard Lynn"
  },
  {
    "description": "Kyle Bristow first gained notoriety when he began inviting white nationalists to speak on campus while he led the Young Americans for Freedom (YAF) chapter at Michigan State University in 2006.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kyle-bristow",
    "born": "1986",
    "name": "Kyle Bristow"
  },
  {
    "description": "Boyd Cathey has been involved in several extremist movements, including \"radical traditionalist Catholicism,\" Holocaust denial and the neo-Confederate movement.",
    "ideology": "Neo-Confederate",
    "died": "",
    "group": "Institute for Historical Review",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/boyd-cathey",
    "born": "1950",
    "name": "Boyd Cathey"
  },
  {
    "description": "An iconic figure of the radical right, Louis Beam played a key role in shaping the revolutionary racist movement in the United States during the three decades following the Vietnam War as one of its principal theorists and strategists.",
    "ideology": "Christian Identity",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/louis-beam",
    "born": "1946",
    "name": "Louis Beam"
  },
  {
    "description": "German-born Ernst Zundel came to prominence in the world of Holocaust denial, or what he prefers to call historical \"revisionism,\" in the 1980s, when his Samisdat Publishing company began distributing propaganda like a \"Did 6 Million Really Die?\" pamphlet and Zundel's own book, The Hitler We Loved and Why.",
    "ideology": "Holocaust Denial",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/ernst-zundel",
    "born": "1939",
    "name": "Ernst  Zundel"
  },
  {
    "description": "Tony Perkins heads the Family Research Council, an anti-LGBT hate group located in Washington, D.C. Perkins has a sordid political history, having once purchased Klansman David Duke’s mailing list for use in a Louisiana political campaign he was managing. In 2001, Perkins gave a speech to a Louisiana chapter of the Council of Conservative Citizens, a white supremacist group.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "Family Research Council",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/tony-perkins",
    "born": "1963",
    "name": "Tony Perkins"
  },
  {
    "description": "Paul Fromm is a Canadian neo-Nazi based in the Toronto area.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/paul-fromm",
    "born": "1949",
    "name": "Paul Fromm"
  },
  {
    "description": "Garrett Hardin was a prolific and controversial writer whose 1968 article “The Tragedy of the Commons” launched him onto the national stage as one of the intellectual leaders of the environmental movement.",
    "ideology": "White Nationalist",
    "died": "2003",
    "group": "Federation for American Immigration Reform",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/garrett-hardin",
    "born": "1915",
    "name": "Garrett Hardin"
  },
  {
    "description": "Bryan Fischer, a nationally syndicated Christian radio host, has a long history of anti-gay activism.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "American Family Association",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/bryan-fischer",
    "born": "1951",
    "name": "Bryan Fischer"
  },
  {
    "description": "Harold C. \"Hal\" Turner is a white supremacist true believer who has used radio and Internet broadcasts to disseminate his hate since the 1990s.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/hal-turner",
    "born": "1962",
    "name": "Hal Turner"
  },
  {
    "description": "Richard Bertollini struck it rich in the 1990s when he cashed out of his Silicon Valley, Calif., computer company. He relocated to Idaho and invested his millions in pushing the racist theology of Christian Identity, which describes Jews as biologically Satanic.",
    "ideology": "Christian Identity",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/vincent-bertollini",
    "born": "1939",
    "name": "Vincent Bertollini"
  },
  {
    "description": "Fred Phelps is America's most notorious anti-gay activist. On his \"God Hates Fags\" website and in tracts sent from his church compound in Topeka, Kan., Phelps and his congregation — composed mainly of his extended family — pump out reams of anti-gay material, much of it so vulgar that many anti-gay activists complain that Phelps has given them a bad name.",
    "ideology": "Anti-LGBT",
    "died": "2014",
    "group": "Westboro Baptist Church",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/fred-phelps",
    "born": "1929",
    "name": "Fred Phelps"
  },
  {
    "description": "A highly decorated Vietnam Veteran and the supposed inspiration for Sylvester Stallone's character in the original Rambo movie \"First Blood,\" Bo Gritz has dedicated himself for decades to denouncing the \"New World Order\" and training an army of anointed \"Eternal Warriors\" to battle against the evil that resides in \"high places.\"",
    "ideology": "Christian Identity",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/bo-gritz",
    "born": "1939",
    "name": "Bo Gritz"
  },
  {
    "description": "Peter Brimelow, a leading anti-immigration activist and author of the bestselling anti-immigrant tome Alien Nation, is the president of the VDARE Foundation, a nonprofit that warns against the polluting of America by non-whites, Catholics, and Spanish-speaking immigrants.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "VDARE",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/peter-brimelow",
    "born": "1947",
    "name": "Peter Brimelow"
  },
  {
    "description": "A hot-tempered, longtime white supremacist and Christian Identity minister who now suffers from severe diabetes, August Kreis III is a longtime white supremacist once headed one of a handful of competing splinter factions of the once-mighty Aryan Nations.",
    "ideology": "Christian Identity",
    "died": "",
    "group": "Aryan Nations",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/august-kreis",
    "born": "1954",
    "name": "August Kreis"
  },
  {
    "description": "David Lane has spent most of his career as a key background organizer for the evangelical community.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-lane-0",
    "born": "1955",
    "name": "David Lane"
  },
  {
    "description": "Attorney and author Edgar Steele was a little-known Idaho lawyer until 2000, when he represented the neo-Nazi Aryan Nations after the group was sued by the Southern Poverty Law Center.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/edgar-steele",
    "born": "1945",
    "name": "Edgar Steele"
  },
  {
    "description": "William Shockley, Stanford professor and winner of the 1956 Nobel Prize in physics for his co-invention of the transistor, was arguably the single person most responsible for ushering in the computer age. He was also an ardent eugenicist whose theories of black racial inferiority eventually made him an academic pariah.",
    "ideology": "White Nationalist",
    "died": "1989",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/william-shockley",
    "born": "1910",
    "name": "William Shockley"
  },
  {
    "description": "Henry Harpending is a controversial anthropologist at the University of Utah who studies human evolution and, in his words, “genetic diversity within and between human populations.”",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/henry-harpending",
    "born": "1944",
    "name": "Henry Harpending"
  },
  {
    "description": "Thomas Robb is an Arkansas-based Christian Identity pastor and head of the Knights of the Ku Klux Klan, which he took over in the 1980s after the departure of David Duke.",
    "ideology": "Christian Identity",
    "died": "",
    "group": "Knights of the Ku Klux Klan",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/thomas-robb",
    "born": "1946",
    "name": "Thomas Robb"
  },
  {
    "description": "Andrew Anglin is the founder of the neo-Nazi Daily Stormer website, which aptly takes its name from the gutter Nazi propaganda sheet known as Der Stürmer. True to that vintage, Anglin is infamous for the crudity of his language and his thinking, a contrast to his sophistication as a prolific Internet troll and serial harasser.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/andrew-anglin",
    "born": "1984",
    "name": "Andrew Anglin"
  },
  {
    "description": "Glenn Spencer is a vitriolic Mexican-basher and self-appointed guardian of the border who may have done more than anyone to spread the myth of a secret Mexican conspiracy to reconquer the Southwest (an effort supposedly known as “la reconquista”).",
    "ideology": "Anti-Immigrant",
    "died": "",
    "group": "American Border Patrol/American Patrol",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/glenn-spencer",
    "born": "1938",
    "name": "Glenn Spencer"
  },
  {
    "description": "Tim Wildmon, president of the rabidly anti-gay American Family Association (AFA), leads a Christian Right propaganda hub of vast outreach. The group owns about 200 radio stations and has 2 million online supporters, two Internet TV channels and a $20 million annual budget. Wildmon took over the Mississippi-based organization, which is listed by the Southern Poverty Law Center as a hate group, after the 2010 retirement of his father, AFA founder Donald Wildmon.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "American Family Association",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/tim-wildmon",
    "born": "1963",
    "name": "Tim Wildmon"
  },
  {
    "description": "Gary \"Gerhard\" Lauck, an American with a put-on German accent and Hitlerite moustache, is often referred to as the \"Farm Belt Fuhrer.\" From his home in Lincoln, Neb., Lauck exported or smuggled millions of pieces of neo-Nazi propaganda in 10 languages to at least 30 countries in the 1990s.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/gary-gerhard-lauck",
    "born": "1953",
    "name": "Gary \"Gerhard\" Lauck"
  },
  {
    "description": "A key leader of the white supremacist Council of Conservative Citizens (CCC), Kyle Rogers has deployed his Internet-savvy talents to attract web hits, members and media attention for the white supremacist hate group.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kyle-rogers",
    "born": "1977",
    "name": "Kyle Rogers"
  },
  {
    "description": "John de Nugent is a prolific writer who has worked with numerous hate groups including the neo-Nazi National Alliance and the Holocaust-denying Barnes Review, and individuals like Willis Carto, the anti-Semitic founder of both the The Barnes Review and the now-defunct Liberty Lobby.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/john-de-nugent",
    "born": "1954",
    "name": "John de Nugent"
  },
  {
    "description": "Roan Garcia-Quintana is the Cuban-born, immigrant-bashing executive director of the nativist group Americans Have Had Enough.",
    "ideology": "Anti-Immigrant",
    "died": "",
    "group": "Council of Conservative Citizens",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/roan-garcia-quintana",
    "born": "1950",
    "name": "Roan Garcia-Quintana"
  },
  {
    "description": "Former Vanderbilt University professor Virginia Abernethy is fond of manipulating environmental and population data to suit her white separatist agenda.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/virginia-abernethy",
    "born": "1935",
    "name": "Virginia Abernethy"
  },
  {
    "description": "Alex Jones is almost certainly the most prolific conspiracy theorist in contemporary America.",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/alex-jones",
    "born": "1974",
    "name": "Alex Jones"
  },
  {
    "description": "Former boxer Erich \"The Aryan Barbarian\" Gliebe made a name for himself in the once-powerful neo-Nazi National Alliance (NA) with his innovative moves to recruit young people and others through hate rock music and racist events masquerading as European-American \"cultural festivals.\" But in 2014, he turned the reins of the group over to another well-known white supremacist and appears to have since dropped out of the movement.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "National Alliance",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/erich-gliebe",
    "born": "1963",
    "name": "Erich Gliebe"
  },
  {
    "description": "The antigovernment “sovereign citizens” movement is chock-full of homemade prophets and half-baked historians who traffic in alleged theories about conspiracies against the Constitution. And then there’s James Timothy Turner.",
    "ideology": "Sovereign Citizens Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/james-timothy-turner",
    "born": "1957",
    "name": "James Timothy Turner"
  },
  {
    "description": "Named by Time in 2005 as one of the nation’s “25 Most Influential Evangelicals,” David Barton is a self-styled “historian” who has acted as a key bridge between the mainstream political right and radical-right religious ideology.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-barton",
    "born": "1954",
    "name": "David Barton"
  },
  {
    "description": "Frazier Glenn Miller, who created and led the Carolina Knights of the Ku Klux Klan and the White Patriot Party in the 1980s but ended up testifying against his comrades, is a crude, sieg-heiling anti-Semite who was sentenced to death for the 2014 murder of three people he mistakenly thought were Jewish.",
    "ideology": "Ku Klux Klan",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/frazier-glenn-miller",
    "born": "1940",
    "name": "Frazier Glenn Miller"
  },
  {
    "description": "Even when the Aryan Nations was at the height of its power in the 1990s, few within its leadership could match the rage, paranoia and utter madness of Harold Ray Redfeairn.",
    "ideology": "Neo-Nazi",
    "died": "2003",
    "group": "Aryan Nations",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/ray-redfeairn",
    "born": "1952",
    "name": "Ray Redfeairn"
  },
  {
    "description": "In his personal bearing and tone, Jared Taylor projects himself as a courtly presenter of ideas that most would describe as crudely white supremacist — a kind of modern-day version of the refined but racist colonialist of old.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "American Renaissance",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/jared-taylor",
    "born": "1951",
    "name": "Jared Taylor"
  },
  {
    "description": "A minister for more than four decades, John Weaver is a religious mainstay of the racist neo-Confederate movement and a man who has recently become a leading proponent of training Christians for armed battle.",
    "ideology": "Neo-Confederate",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/john-weaver",
    "born": "1945",
    "name": "John Weaver"
  },
  {
    "description": "Since 1993, Mark Weber, who has probably done more than any other American to popularize denial of the World War II Holocaust of European Jews, has directed the Institute for Historical Review (IHR), a once prominent denial group that has recently been in decline.",
    "ideology": "Holocaust Denial",
    "died": "",
    "group": "Institute for Historical Review",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/mark-weber",
    "born": "1952",
    "name": "Mark Weber"
  },
  {
    "description": "Shaun Walker was the chairman and CEO of the National Alliance, a major neo-Nazi organization, from April 2005 to July 2006.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "National Alliance",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/shaun-walker",
    "born": "1968",
    "name": "Shaun  Walker"
  },
  {
    "description": "John Tanton is the racist architect of the modern anti-immigrant movement. He created a network of organizations – the Federation for American Immigration Reform (FAIR), the Center for Immigration Studies (CIS) and NumbersUSA – that have profoundly shaped the immigration debate in the United States.",
    "ideology": "Anti-Immigrant",
    "died": "",
    "group": "Federation for American Immigration Reform",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/john-tanton",
    "born": "1934",
    "name": "John Tanton"
  },
  {
    "description": "Brien James was among the founders of the Vinlanders Social Club in 2003, after being a member of the Outlaw Hammerskins and helping to form the Hoosier State Skinheads.",
    "ideology": "Racist Skinhead",
    "died": "",
    "group": "Vinlanders Social Club",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/brien-james",
    "born": "1975",
    "name": "Brien James"
  },
  {
    "description": "",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/larry-klayman",
    "born": "1951",
    "name": "Larry Klayman"
  },
  {
    "description": "Paul Ramsey is a white nationalist who posts Internet videos of himself talking to the camera under the screen name of Ramzpaul. Ramsey calls himself a “satirist,” a kind of far-right Jon Stewart, but he is more importantly an ideologue and a hero to much of the radical right.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/paul-ray-ramsey",
    "born": "1963",
    "name": "Paul Ray Ramsey"
  },
  {
    "description": "Barbara Coe was known for her diatribes against Mexican “savages” and her wild conspiracy theories. She was the founder and leader of the California Coalition for Immigration Reform (CCIR). CCIR underwent a name change after Coe’s death in 2013. It is now known as the National Coalition for Immigration Reform (NCIR).",
    "ideology": "Anti-Immigrant",
    "died": "2013",
    "group": "Council of Conservative Citizens",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/barbara-coe",
    "born": "1933",
    "name": "Barbara Coe"
  },
  {
    "description": "Although he died in prison in 2007 at the age of 69, David Lane remains one of the most important ideologues of contemporary white supremacy.",
    "ideology": "White Nationalist",
    "died": "2007",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-lane",
    "born": "1938",
    "name": "David  Lane"
  },
  {
    "description": "Bill White is a voluble and vicious Internet gossip who is sometimes right, sometimes wrong, but always ready to print just about anything that comes into his head.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/bill-white",
    "born": "1977",
    "name": "Bill  White"
  },
  {
    "description": "During his reign as imperial wizard of the American Knights of the Ku Klux Klan, Jeff Berry developed a reputation as a man who welcomed thugs and criminals into what came to be called, informally, the \"bully-boy Klan.\"",
    "ideology": "Ku Klux Klan",
    "died": "2013",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/jeff-berry",
    "born": "1953",
    "name": "Jeff Berry"
  },
  {
    "description": "Raised to revere the Nazis, April Gaede spent most of her racist career as a neo-Nazi stage mom.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "National Vanguard",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/april-gaede",
    "born": "1966",
    "name": "April Gaede"
  },
  {
    "description": "Kevin Lamb has been contributing to white nationalist publishing since the early 1990s. He has worked in an editorial capacity for multiple branches of Eagle Publishing, including The Occidental Quarterly. He currently serves as the managing editor of The Social Contract magazine, and is a regular contributor to the white nationalist website VDARE.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "The Social Contract Press",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kevin-lamb",
    "born": "1963",
    "name": "Kevin Lamb"
  },
  {
    "description": "",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/tom-deweese",
    "born": "1949",
    "name": "Tom DeWeese"
  },
  {
    "description": "Harry Cooper is the founder of Sharkhunters International, a company that organizes tours to sites that were historically important to the Third Reich, such as the Wolf’s Lair, Hermann Goering’s house, and Hitler’s vacation homes in Bavaria. These tours, or “patrols” as they are referred to, are presented as opportunities to “relive history” — in this case, the troublesome history of the Nazi leadership of the Third Reich.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/harry-cooper",
    "born": "1944",
    "name": "Harry Cooper"
  },
  {
    "description": "Louis Farrakhan heads the Nation of Islam, a group he has led since 1977 and that is based on a somewhat bizarre and fundamentally anti-white theology. Farrakhan is an anti-Semite who routinely accuses Jews of manipulating the U.S. government and controlling the levers of world power.",
    "ideology": "Black Separatist",
    "died": "",
    "group": "Nation of Islam",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/louis-farrakhan",
    "born": "1933",
    "name": "Louis Farrakhan"
  },
  {
    "description": "Mike Vanderboegh, a longtime leader and propagandist in the antigovernment “Patriot” movement, specializes in fiery rhetoric urging violent “self-defense” against a tyrannical, Constitution-flouting U.S. government determined to impose the Communist principles of gun control and universal health care.",
    "ideology": "Antigovernment Movement",
    "died": "2016",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/michael-brian-vanderboegh-0",
    "born": "1953",
    "name": "Michael Brian Vanderboegh"
  },
  {
    "description": "In recent years, thanks largely to his leadership of TheCall Ministries, Lou Engle has become one of the more prominent players on the American religious right.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/lou-engle",
    "born": "1953",
    "name": "Lou Engle"
  },
  {
    "description": "Jeff Schoep has been a neo-Nazi true believer since age 10 who has managed, largely by luck, to end up heading one of the largest explicitly Hitlerite groups in America.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "National Socialist Movement",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/jeff-schoep",
    "born": "1973",
    "name": "Jeff Schoep"
  },
  {
    "description": "James Wickstrom may be America's hardest-line preacher of the racist and anti-Semitic theology of Christian Identity.",
    "ideology": "Christian Identity",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/james-wickstrom",
    "born": "1942",
    "name": "James  Wickstrom"
  },
  {
    "description": "As head of the National Policy Institute (NPI), Richard Spencer is one of the country’s most successful young white nationalist leaders —a suit-and-tie version of the white supremacists of old, a kind of professional racist in khakis.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/richard-bertrand-spencer-0",
    "born": "1978",
    "name": "Richard Bertrand Spencer"
  },
  {
    "description": "Tomislav Sunic is a former Croatian diplomat who provides an intellectual voice for white nationalists in America.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "American Freedom Party",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/tomislav-suni%C4%87",
    "born": "1953",
    "name": "Tomislav Sunić"
  },
  {
    "description": "Kevin MacDonald is the neo-Nazi movement's favorite academic. A psychology professor at California State University, Long Beach, MacDonald published a trilogy that supposedly \"proves\" that Jews are genetically driven to destroy Western societies.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "Occidental Quarterly",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kevin-macdonald",
    "born": "1944",
    "name": "Kevin MacDonald"
  },
  {
    "description": "Malik Shabazz is a racist black nationalist with a long, well-documented history of violently anti-Semitic remarks and accusations about the inherent evil of white people.",
    "ideology": "Black Separatist",
    "died": "",
    "group": "New Black Panther Party",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/malik-zulu-shabazz",
    "born": "1966",
    "name": "Malik Zulu Shabazz"
  },
  {
    "description": "David Duke is the most recognizable figure of the American radical right, a neo-Nazi, longtime Klan leader and now international spokesman for Holocaust denial who has nevertheless won election to Louisiana's House of Representatives and once was nearly elected governor.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "EURO",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-duke",
    "born": "1950",
    "name": "David Duke"
  },
  {
    "description": "Kirk Lyons is a white supremacist lawyer who co-founded and serves as the \"chief trial counsel\" for the Southern Legal Resource Center (SLRC), which has effectively become the legal arm of the neo-Confederate movement.",
    "ideology": "Neo-Confederate",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kirk-lyons",
    "born": "1956",
    "name": "Kirk  Lyons"
  },
  {
    "description": "Despite Horowitz being a founding intellectual member of the New Left in the 1960s, and an advocate for civil rights and equality, he has since the late 1980’s become a driving force of the anti-Muslim, anti-immigrant and anti-black movements.",
    "ideology": "Anti-Immigrant",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-horowitz",
    "born": "1939",
    "name": "David Horowitz"
  },
  {
    "description": "Once a respectable Washington insider, Frank Gaffney Jr. is now one of America’s most notorious Islamophobes.",
    "ideology": "Anti-Muslim",
    "died": "",
    "group": "Center for Security Policy",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/frank-gaffney-jr",
    "born": "1953",
    "name": "Frank Gaffney Jr."
  },
  {
    "description": "Arguably the only true intellectual remaining in the American neo-Nazi movement following the 2002 death of National Alliance founder William Pierce, Kevin Alfred Strom is a bookish yet dogmatic neo-Nazi whose predilection for child pornography ultimately ruined his efforts to claim his former master's legacy.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "National Alliance",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kevin-strom",
    "born": "1956",
    "name": "Kevin Strom"
  },
  {
    "description": "Longing for a \"whites-only\" homeland in the Pacific Northwest, aerospace engineer Richard Butler left California in the early 1970s and purchased land in northern Idaho. That land became home to one of the most notorious American hate groups, the Church of Jesus Christ Christian/Aryan Nations.",
    "ideology": "Neo-Nazi",
    "died": "2004",
    "group": "Aryan Nations",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/richard-butler",
    "born": "1918",
    "name": "Richard Butler"
  },
  {
    "description": "Billy Roper is the uncensored voice of violent neo-Nazism. Whether he's admiring the 9/11 attacks or discussing his racial ideals, this one-time schoolteacher isn't afraid to celebrate genocide and mass murder.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "National Alliance",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/billy-roper",
    "born": "1972",
    "name": "Billy  Roper"
  },
  {
    "description": "Eric “The Butcher” Fairburn was among the founders of the Vinlanders Social Club, a racist skinhead group formed in 2003.",
    "ideology": "Racist Skinhead",
    "died": "",
    "group": "Vinlanders Social Club",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/eric-butcher-fairburn",
    "born": "1974",
    "name": "Eric \"The Butcher\" Fairburn"
  },
  {
    "description": "Jamie Kelso is an extremely hyper organizer and serial joiner of religious sects and, starting in the 1990s, racist organizations.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "American Freedom Party",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/jamie-kelso",
    "born": "1948",
    "name": "Jamie Kelso"
  },
  {
    "description": "Michael Boldin is an ideologue who has spent years promoting the idea that states can “nullify” federal legislation they don’t like — the very same argument pushed by defenders of slavery and segregation, and just as baseless now as it was then.",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/michael-boldin",
    "born": "1973",
    "name": "Michael Boldin"
  },
  {
    "description": "Under normal circumstances, there’s something endearing about youthful idealism. But when it comes to Kevin DeAnna, founder and recently departed head of the ultraconservative student group Youth for Western Civilization (YWC), normal circumstances do not apply.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/kevin-deanna",
    "born": "1983",
    "name": "Kevin DeAnna"
  },
  {
    "description": "Considered by many to be the face of a new generation of white nationalists, Matthew Heimbach founded a campus chapter of Youth for Western Civilization at Towson University in Maryland and later started the White Student Union there. He also has been a member of the neo-Confederate League of the South. Since graduating in the spring of 2013, he has entrenched himself further in the white nationalist movement and become a regular speaker on the radical-right lecture circuit.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/matthew-heimbach",
    "born": "1991",
    "name": "Matthew Heimbach"
  },
  {
    "description": "J.T. (Jason Todd) Ready, a former member of the neo-Nazi National Socialist Movement, specialized in bashing immigrants.",
    "ideology": "Neo-Nazi",
    "died": "2012",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/jt-ready",
    "born": "1973",
    "name": "J.T. Ready"
  },
  {
    "description": "David Irving was once treated with great respect for his historical tomes on World War II and Nazi Germany. But in recent years, the writer has become known as the world's most prominent Holocaust denier.",
    "ideology": "Holocaust Denial",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/david-irving",
    "born": "1938",
    "name": "David  Irving"
  },
  {
    "description": "Raymond B. Cattell was by any measure one of the most prolific and influential psychologists of the 20th century. Cattell was a pioneer in the study of personality and the development of psychometric tests, for which he received numerous awards over his lifetime.",
    "ideology": "White Nationalist",
    "died": "1998",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/raymond-cattell",
    "born": "1905",
    "name": "Raymond Cattell"
  },
  {
    "description": "Paul Mullet is a neo-Nazi and Christian Identity adherent with a long history of theft. He has been involved with the Knights of the Ku Klux Klan and the Aryan Nations and formed the American National Socialist Party in 2010.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/paul-mullet",
    "born": "1973",
    "name": "Paul Mullet"
  },
  {
    "description": "Craig Cobb is best known for his botched effort to transform the tiny hamlet of Leith, N.D., into an Aryan stronghold, a secret campaign which ultimately landed him in jail and, in 2014, on four years of probation while tethered to a monitoring device. An itinerant neo-Nazi who joined a whole variety of racist groups over the decades and even operated from Estonia for a time, Cobb became known as an especially vicious character who posted horrific videos of things like Russian neo-Nazis beheading immigrants on his Podblanc video-sharing site.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/craig-cobb",
    "born": "1951",
    "name": "Craig Cobb"
  },
  {
    "description": "Yale Law School graduate Stewart Rhodes in 2009 founded the far-right Oath Keepers, a fiercely antigovernment, militaristic group that improbably claims more than 30,000 law enforcement officers, soldiers and military veterans as members.",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/elmer-stewart-rhodes-0",
    "born": "1966",
    "name": "Elmer Stewart Rhodes"
  },
  {
    "description": "After David Duke, Tom Metzger is one of the most notorious living white supremacists in the United States. He is a former California grand dragon of the Knights of the Ku Klux Klan who, in the mid-1980s, founded White Aryan Resistance (WAR), one of the leading racist groups of the period and the publisher of a gutturally racist tabloid.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/tom-metzger",
    "born": "1938",
    "name": "Tom Metzger"
  },
  {
    "description": "Willis Carto has been a major figure on the American radical right since the 1950s, when he set up his anti-Semitic Liberty Lobby with offices not far from the White House.",
    "ideology": "Holocaust Denial",
    "died": "2015",
    "group": "Barnes Review",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/willis-carto",
    "born": "1926",
    "name": "Willis Carto"
  },
  {
    "description": "Charles Murray, a fellow at the American Enterprise Institute, has become one of the most influential social scientists in America, using racist pseudoscience and misleading statistics to argue that social inequality is caused by the genetic inferiority of the black and Latino communities, women and the poor.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/charles-murray",
    "born": "1943",
    "name": "Charles Murray"
  },
  {
    "description": "Educational psychologist Linda Gottfredson has spent more than three decades fighting against the idea that social equality between black and white Americans is possible, or even desirable.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "Pioneer Fund",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/linda-gottfredson",
    "born": "1947",
    "name": "Linda Gottfredson "
  },
  {
    "description": "As the director of the Jihad Watch blog and co-founder of Stop Islamization of America, Robert Spencer is one of America’s most prolific and vociferous anti-Muslim propagandists.",
    "ideology": "Anti-Muslim",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/robert-spencer",
    "born": "1962",
    "name": "Robert Spencer"
  },
  {
    "description": "Matt Hale spent years pumping out violent and aggressive propaganda, particularly once he became \"Pontifex Maximus\" of the World Church of the Creator, which for a time was one of the largest neo-Nazi groups in America.",
    "ideology": "Neo-Nazi",
    "died": "",
    "group": "Creativity Movement",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/matt-hale",
    "born": "1971",
    "name": "Matt Hale"
  },
  {
    "description": "Wayne Lutton is the gay-bashing, immigrant-hating editor of The Social Contract, a journal published by the hate group The Social Contract Press and the closest colleague of the founder of the modern anti-immigration movement and head of the group, John Tanton.",
    "ideology": "Anti-Immigrant",
    "died": "",
    "group": "The Social Contract Press",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/wayne-lutton",
    "born": "1949",
    "name": "Wayne Lutton"
  },
  {
    "description": "Michael Hill represents the intellectual but racist faction of the neo-Confederate movement and is its most important proponent.",
    "ideology": "Neo-Confederate",
    "died": "",
    "group": "League of the South",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/michael-hill",
    "born": "1951",
    "name": "Michael Hill"
  },
  {
    "description": "Dan Stein heads the Federation for American Immigration Reform, the flagship of a network of anti-immigrant groups affiliated with its founder, the white nationalist John Tanton.",
    "ideology": "Anti-Immigrant",
    "died": "",
    "group": "Federation for American Immigration Reform",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/dan-stein",
    "born": "1955",
    "name": "Dan Stein"
  },
  {
    "description": "Pamela Geller is the anti-Muslim movement's most visible and flamboyant figurehead.",
    "ideology": "Anti-Muslim",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/pamela-geller",
    "born": "1958",
    "name": "Pamela Geller"
  },
  {
    "description": "Gary DeMar is president of the Christian Reconstructionist think tank American Vision.",
    "ideology": "Anti-LGBT",
    "died": "",
    "group": "",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/gary-demar",
    "born": "1958",
    "name": "Gary Demar"
  },
  {
    "description": "",
    "ideology": "Antigovernment Movement",
    "died": "",
    "group": "WorldNetDaily",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/joseph-francis-farah",
    "born": "1955",
    "name": "Joseph Francis Farah"
  },
  {
    "description": "Ron Doggett has been involved in several important hate groups since his teen years, including the White Patriot Party and the neo-Nazi National Alliance.",
    "ideology": "White Nationalist",
    "died": "",
    "group": "EURO",
    "url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/ronald-doggett",
    "born": "1962",
    "name": "Ronald Doggett"
  }
]